app/views/rooms/index.html.erb

SELECT "users".* FROM "users" INNER JOIN "messages" ON "users"."id" = "messages"."user_id" WHERE "messages"."room_id" = $1  [["room_id", 1]]
SELECT COUNT(*) FROM "users" INNER JOIN "messages" ON "users"."id" = "messages"."user_id" WHERE "messages"."room_id" = $1  [["room_id", 1]]
---
              <span class='member-count'>
                <small><%= room.users.uniq.count %> Members </small>

SELECT "messages".* FROM "messages" WHERE "messages"."room_id" = $1  [["room_id", 4]]
---
          <div id="messages">
            <% @room.messages.each do |message| %>