app/controllers/messages_controller.rb

  def create
    @message = Message.new(message_params)
    @message.user = current_user
    @message.save
---
INSERT INTO "messages" ("content", "user_id", "room_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "hey"], ["user_id", 1], ["room_id", 1], ["created_at", "2020-10-09 14:42:22.602893"], ["updated_at", "2020-10-09 14:42:22.602893"]]